Rails/Assignment 2/facebook/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "User_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "post 1"], ["content", "helloo"], ["User_id", 1], ["created_at", "2022-02-27 12:34:09.931620"], ["updated_at", "2022-02-27 12:34:09.931620"]]