Rails/Assignment 2/facebook/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "age", "gender", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "fa"], ["email", "fatma.s271@gmail.com"], ["age", "25"], ["gender", "jj"], ["created_at", "2022-02-27 12:20:25.957210"], ["updated_at", "2022-02-27 12:20:25.957210"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save